#รับค่าองศาเซลเซียส (Celsius: c) ทางคีย์บอร์ด และแปลงหน่วยอุณหภูมิองศาเซลเซียส
#เป็นองศาฟาเรนไฮต์ (Fahrenheit) สูตรคํานวณ ดังนี้

c = float(input("ใส่อุณหภูมิที่คุณต้องการ (องศาเซลเซียล) : "))                    #ให้ผู้ใช้ระบุอุณหภูมิหน่วงองศาเซลเซียลที่ต้องการ
resultf = c * 9 / 5 + 32                                                   #คำนวณจากสูตร
print("*" *20)
print(f"อุณหภูมิที่คุณป้อน : {c} องศาเซลเซียล")                                  #แสดงอุณหภูมิที่ผู้ใช้ป้อน
print(f"แปลงอุณหภูมิจากองศาเซลเซียล เป็น องศาฟาเรนไฮท์ = {resultf} ฟาเรนไฮท์")   #แสดงผลลัพธ์เป็นฟาเรนไฮท์
print("*" *20)


#รับค่าองศาเซลเซียส (Fahrenheit: f) ทางคีย์บอร์ด และแปลงหน่วยอุณหภูมิองศาฟาเรนไฮต์ (Fahrenheit) เป็นองศาเซลเซียส 
# (Celsius) สูตรคํานวณดังนี้

f = float(input("ใส่อุณหภูมิที่คุณต้องการ (ฟาเรนไฮท์) : "))                          #ให้ผู้ใช้ระบุอุณหภูมิหน่วงองศาฟาเรนไฮท์ที่ต้องการ
resultc = ((f - 32) / 9 ) * 5                                                 #คำนวณจากสูตร
print("*" *20)
print(f"อุณหภูมิที่คุณป้อน : {f} ฟาเรนไฮท์")                                        #แสดงอุณหภูมิที่ผู้ใช้ป้อน
print(f"แปลงอุณหภูมิจากอางศาฟาเรนไฮท์ เป็น องศาเซลเซียล = {resultc:0.1} เซลเซียล")       #แสดงผลลัพธ์เป็นเซลเซียล
print("*" *20)