#นิพจน์การคํานวณต่อไปนี้ให้คํานวณตามลําดับการทํางานของเครื่องหมายมีผลลัพธ์เป็นเท่าใด

ans1 = 1 + 2 * 3
print(f"1.) 1+2*3 = {ans1}")

ans2 = 2 ++ 2 // 3
print(f"2.) 2++2//3 = {ans2}")

ans3 = 2 ** -2
print(f"3.) 2**-2 = {ans3}")

ans4 = 2 * 3 ** 2 - (-5)
print(f"4.) 2*3**2-(-5) = {ans4}")

ans5 = (2 + 3) % 2
print(f"5.) (2+3)%2 = {ans5}")

ans6 = 2 ** 3 // 10 ** (1 + 2)
print(f"6.) 2**3//10**(1+2) = {ans6}")

ans7 = 2 ** 2 ** 3
print(f"7.) 2**2**3 = {ans7}")

ans8 = -(-(-(-(-5))))
print(f"8.) -(-(-(-(-5)))) = {ans8}")

ans9 = float(10.0 / 5)
print(f"9.) 10.0 / 5  = {ans9}")
